// Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
Console.WriteLine("Введите 1 число");
int A = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите 2 число");
int B = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(Math.Pow(A, B));
